app/views/users/show.html.erb

<div id="user_posts">
	<% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]