app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
	<div>
		<% @post.comments.each do |comment| %>