app/controllers/comments_controller.rb

  def create
    @user = current_user
    @post = Post.find(params[:comment][:post_id])
    @comment = @user.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["content", "fdasf"], ["created_at", "2017-08-01 21:32:22.955142"], ["updated_at", "2017-08-01 21:32:22.955142"]]