app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def index
    @user = current_user
    @posts = Post.find(params[:id])

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new post"], ["content", "some content"], ["user_id", 1], ["created_at", "2017-07-09 00:30:55.480665"], ["updated_at", "2017-07-09 00:30:55.480665"]]
---
  def create
    @user = current_user
    @user.posts.create(params[:post])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @user = current_user
    @posts = Post.find(params[:id])