app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password", "chickens", "bees", "bats", "dogs", "cats", "home_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @user = current_user
    @post = Post.new
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]