app/views/profile/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
<div id="user_posts">
	<% @user.posts.each do |post| %>